<!-- dflook/terraform-github-actions {"workspace":"tf-test","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"db13acfe564b7d44da8c5f0d88086f49d02c0d70ed930ef5f304ed2e49d7c5cd","plan_job_ref":"Job Test plan target and replace #424 at https://github.com/dflook/terraform-github-actions/actions/runs/9331228369","plan_hash":"ed573929921e1151fd526eeb1475ef96529f2c076a39598e238c2db234daed47","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tf-test__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "orFWcO4otd" -> (known after apply)
!~  foreach = "A4c5AwH24A" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #424](https://github.com/dflook/terraform-github-actions/actions/runs/9331228369)